ETL/InformationRegisters/ДополнительныеСведенияПрочихПоказателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>ДополнительныеСведенияПрочихПоказателей</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипСтатьи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДвиженияСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокСчетовСтатейБюджета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ВидПоказателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПрочихПоказателейMDM</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Показатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.INDПрочиеПоказатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Статьи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПланСчетов</v8:Type>
						<v8:Type>cfg:CatalogRef.СтатьиБюджетов</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыДвижения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ETL/Catalogs/ВидыПрочихПоказателейMDM.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>ВидыПрочихПоказателейMDM</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСправочника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьВДЗО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПоказателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыПрочихПоказателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнойВвод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеДляЗаполнения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВерсии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КолонкиПоказателей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяКолонки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СинонимКолонки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеОтображатьВДЗО</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РучнойВвод</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИспользуетНастройкиСвязей</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СтрокиПоказателей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Показатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.INDПрочиеПоказатели</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодПоказателя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СвязиПоказателя</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СвязиПрочихПоказателей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеСобиратьИтоги</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УровеньИерархии</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РучнойВвод</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Организации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ETL/InformationRegisters/ДополнительныеСведенияПрочихПоказателей/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервере
Процедура ОбновитьРегистрНаСервере()
	Результат =ИнтеграцияДЗО.GetTypesOfOtherIndicators();
	
	
	

	Для каждого стр из Результат.TypesOfOtherIndicators Цикл
		
		СпрССылка = Справочники.ВидыПрочихПоказателейMDM.НайтиПоКоду(стр.Code); 
		Если ЗначениеЗаполнено(СпрССылка) Тогда
			НаборПоказателя = РегистрыСведений.ДополнительныеСведенияПрочихПоказателей.СоздатьНаборЗаписей();
			НаборПоказателя.Отбор.ВидПоказателя.Установить(СпрССылка);
			НаборПоказателя.Прочитать();
			НаборПоказателя.Очистить();
			НаборПоказателя.Записать();
		КонецЕсли;
		Если СпрССылка.Пустая() Тогда
			СпрОбъект = Справочники.авВидыПрочихПоказателейMDM.СоздатьЭлемент();	
		Иначе
			СпрОбъект = СпрССылка.ПолучитьОбъект();	
		КонецЕсли;
		
		СпрОбъект.Код = стр.Code;
		Для Каждого СтрОрганизация Из СпрОбъект.Организации Цикл
		Если стр.ArrayIndicatorMDM.IndicatorMDM.Количество() Тогда 
			
			Для Каждого IndicatorMDM Из стр.ArrayIndicatorMDM.IndicatorMDM Цикл
				СтрокаПоказателя = СпрОбъект.СтрокиПоказателей.Добавить();
				СтрокаПоказателя.Показатель = Справочники.INDПрочиеПоказатели.НайтиПоКоду(IndicatorMDM.Code); 
				
				Если IndicatorMDM.BudgetItem.Количество() Тогда 
					Для КАждого СтрокаБюджета Из IndicatorMDM.BudgetItem Цикл
						Набор = РегистрыСведений.ДополнительныеСведенияПрочихПоказателей.СоздатьНаборЗаписей();
						СтатьяБюджета = Справочники.СтатьиБюджетов.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаБюджета.BudgetItem)); 
						Набор.Отбор.Период.Установить(СпрОбъект.Период);
						Набор.Отбор.ВидПоказателя.Установить(СпрОбъект.Ссылка);
						Набор.Отбор.Показатель.Установить(СтрокаПоказателя.Показатель);
						Набор.Отбор.Статьи.Установить(СтатьяБюджета);
						Набор.Отбор.Организация.Установить(СтрОрганизация.Организация);
						Набор.Прочитать();
						Набор.Очистить(); 
						Запись = Набор.Добавить();
						Запись.Период   = СпрОбъект.Период;  
						Запись.ВидПоказателя   = СпрОбъект.Ссылка;
						Запись.Показатель   = СтрокаПоказателя.Показатель;
						Запись.Статьи   = СтатьяБюджета;
						Запись.Организация   = СтрОрганизация.Организация;
						Запись.ТипСтатьи   = "Статья бюджета";
						Запись.СписокСчетовСтатейБюджета   = СтрокаБюджета.BudgetAccaunts;
						Набор.Записать(Истина);
					КонецЦикла;
					
				КонецЕсли; 
				
				
				Если IndicatorMDM.TypeMovement.Количество() Тогда 
					Для КАждого ВидДвижения Из IndicatorMDM.TypeMovement Цикл 
						ВДвижения = Справочники.ВидыДвижения.ПолучитьСсылку(Новый УникальныйИдентификатор(ВидДвижения));
						Набор = РегистрыСведений.ДополнительныеСведенияПрочихПоказателей.СоздатьНаборЗаписей();
						Набор.Отбор.Период.Установить(СпрОбъект.Период);
						Набор.Отбор.ВидПоказателя.Установить(СпрОбъект.Ссылка);
						Набор.Отбор.Показатель.Установить(СтрокаПоказателя.Показатель);
						Набор.Отбор.Организация.Установить(СтрОрганизация.Организация);
						Набор.Отбор.Статьи.Установить(ВДвижения); 
						Набор.Прочитать();
						Набор.Очистить(); 
						Запись = Набор.Добавить();
						Запись.Период   = СпрОбъект.Период;  
						Запись.ВидПоказателя   = СпрОбъект.Ссылка;
						Запись.Показатель   = СтрокаПоказателя.Показатель; 
						Запись.Организация   = СтрОрганизация.Организация;
						Запись.Статьи   = ВДвижения;
						Запись.ТипСтатьи   = "Вид движения";
						Набор.Записать(Истина);
					КонецЦикла;
					
				КонецЕсли;
				
				Если IndicatorMDM.Account.Количество() Тогда 
					Для КАждого Счет Из IndicatorMDM.Account Цикл  
						авСчет = Справочники.ПланСчетов.ПолучитьСсылку(Новый УникальныйИдентификатор(Счет.AccauntGUID));
						Если ЗначениеЗаполнено(авСчет) Тогда
							Набор = РегистрыСведений.ДополнительныеСведенияПрочихПоказателей.СоздатьНаборЗаписей();
							Набор.Отбор.Период.Установить(СпрОбъект.Период);
							Набор.Отбор.ВидПоказателя.Установить(СпрОбъект.Ссылка);
							Набор.Отбор.Показатель.Установить(СтрокаПоказателя.Показатель);
							Набор.Отбор.Организация.Установить(СтрОрганизация.Организация);
							Набор.Отбор.Статьи.Установить(авСчет); 
							Набор.Прочитать();
							Набор.Очистить(); 
							Запись = Набор.Добавить();
							Запись.Период   = СпрОбъект.Период;  
							Запись.ВидПоказателя   = СпрОбъект.Ссылка;
							Запись.Показатель   = СтрокаПоказателя.Показатель;
							Запись.Организация   = СтрОрганизация.Организация;
							Запись.Статьи   = авСчет;
							Запись.ТипСтатьи        = "Счет";
							Запись.ТипДвиженияСчета   = Счет.AccauntTypeMovement;
							Набор.Записать(Истина); 
						КонецЕсли;
					КонецЦикла;
					
				КонецЕсли;
				
				
				
				
			КонецЦикла;
			
			
		КонецЕсли;
		//СпрОбъект.Записать();
		
		
	КонецЦикла;
	КонецЦикла;
	


	
	
	
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьРегистр(Команда)
	ОбновитьРегистрНаСервере();
КонецПроцедуры
